---
kind: property
id: P:Autodesk.Revit.DB.City.Name
source: html/11d7f9f5-bac7-234d-3433-15e768c8593b.htm
---
# Autodesk.Revit.DB.City.Name Property

The name of the city

## Syntax (C#)
```csharp
public string Name { get; }
```

## Remarks
A read only string property that contains the name of the city, such as Boston.